tap "caarlos0/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jarred-sumner/git-peek"
tap "koekeishiya/formulae"
tap "riscv/riscv"
tap "theseal/ssh-askpass"
tap "wader/tap"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Collection of portable C++ source libraries
brew "boost"
# Standard XML representation system for technical documents
brew "docbook"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Draw boxes around text
brew "boxes"
# (Arguably) the best yacc variant
brew "byacc"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU compiler collection
brew "gcc"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Tool for browsing source code
brew "cscope"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# X.Org: X FreeType library
brew "libxft"
# Dynamic menu for X11
brew "dmenu"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# QUIC transport protocol implementation
brew "mvfst"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Process Management Interface for HPC environments
brew "pmix"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# High-velocity, monorepo-scale workflow for Git
brew "git-branchless"
# Small git utilities
brew "git-extras"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Version Control Visualization Tool
brew "gource"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GNU troff text-formatting system
brew "groff"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Kubernetes package manager
brew "helm"
# View and edit files in hexadecimal or ASCII
brew "hexedit"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Synchronize a maildir with an IMAP server
brew "isync", restart_service: true
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# JSON diff and patch
brew "jd"
# Git-compatible distributed version control system
brew "jj"
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Terminal file manager
brew "lf"
# C XSLT library for GNOME
brew "libxslt"
# CLI for SQLite Databases with auto-completion and syntax highlighting
brew "litecli"
# Rainbows and unicorns in your console!
brew "lolcat"
# Text-based web browser
brew "lynx"
# Generic machine emulator and virtualizer
brew "qemu"
# Lightweight Linux VMs on MacOS
brew "macpine", restart_service: true
# Scalable distributed version control system
brew "mercurial"
# GDI+-compatible API on non-Windows operating systems
brew "mono-libgdiplus"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Command-line music player client for mpd
brew "mpc"
# Music Player Daemon
brew "mpd"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Node version management
brew "n", link: false
# NCurses Disk Usage
brew "ncdu"
# Ncurses-based client for the Music Player Daemon
brew "ncmpcpp"
# Fast, highly customisable system info script
brew "neofetch"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node", link: false
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Create, run, and share large language models (LLMs)
brew "ollama"
# OCaml package manager
brew "opam"
# Development kit for the Java programming language
brew "openjdk@17"
# Google's Operations Research tools
brew "or-tools"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm", link: false
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Python 2 and 3 compatibility utilities
brew "six"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Powerful free data recovery utility
brew "testdisk"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Image processing library
brew "vips"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Access X11 clipboards from the command-line
brew "xclip"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# In terminal graphical metrics for your *nix system
brew "zenith"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Clone all repos of a GitHub user or organization
brew "caarlos0/tap/clone-org"
# git repo to local editor instantly
brew "jarred-sumner/git-peek/git-peek"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# RISC-V toolchain including gcc (with newlib), simulator (spike), and pk
brew "riscv/riscv/riscv-tools"
# Passphrase dialog for use with OpenSSH in macOS
brew "theseal/ssh-askpass/ssh-askpass"
# jq for binary formats
brew "wader/tap/fq"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Free and open-source web browser
cask "chromium"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Install and update your Eclipse Development Environment
cask "eclipse-installer"
# Git client for simultaneous branches on top of your existing workflow
cask "gitbutler"
# Web browser
cask "google-chrome"
# Hex editor for reverse engineers
cask "imhex"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# Host-based application firewall
cask "little-snitch"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# File system integration
cask "macfuse"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Open-source software for live streaming and screen recording
cask "obs"
# HTTP debugging proxy
cask "proxyman"
# Environment for statistical computing and graphics
cask "r"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Data science software focusing on R and Python
cask "rstudio"
# MySQL/MariaDB database management
cask "sequel-ace"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Real time file synchronisation software
cask "syncthing"
# Code editor
cask "visual-studio-code@insiders"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
